artillery/sessions.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 180
      arrivalRate: 50
      name: Sustained load
  defaults:
    headers:
      Content-Type: 'application/json'
scenarios:
  - name: "Start Session as an Administrator"
    flow:
      - post:
          url: "/sessions"
          json:
            email: "administrator@insumos.com"
          capture:
            json: "$.results[0].token"
            as: "token"
      - think: 1
  - name: "Start Session as an Applicant"
    flow:
      - post:
          url: "/sessions"
          json:
            email: "applicant@insumos.com"
          capture:
            json: "$.results[0].token"
            as: "token"
      - think: 1